app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Soraia"], ["last_name", "Carmo"], ["created_at", "2017-11-22 16:43:20.153042"], ["updated_at", "2017-11-22 16:43:20.153042"]]