app/controllers/volumes_controller.rb

  def index
    @volumes = Volume.all
---
SELECT "volumes".* FROM "volumes"

  def new
    @volume = Volume.new
    @authors = Author.all
---
SELECT "authors".* FROM "authors"

  def destroy
    @volume.destroy
---
DELETE FROM "volumes" WHERE "volumes"."id" = $1  [["id", 1]]

    def set_volume
      @volume = Volume.find(params[:id])
---
SELECT  "volumes".* FROM "volumes" WHERE "volumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]